app/views/marcas/index.html.erb

				<td class="text-center">
					<%= link_to edit_marca_path(Marca.find(marca.id)), class:"btn btn-small btn-primary" do %>
---
SELECT  "marcas".* FROM "marcas" WHERE "marcas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]