app/views/productos/_form.html.erb

SELECT "marcas".* FROM "marcas"
---
		<div class="col-sm-5">
			<%= f.select :marca, options_for_select(Marca.all.map{ |c| [c.nombre, c.id]}, @producto.marca), {:include_blank => 'Seleccione una marca'}, { :class => 'form-control' } %>