app/views/productos/index.html.erb

SELECT  "marcas".* FROM "marcas" WHERE "marcas"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
				<td>
					<%= Marca.find(producto.marca).nombre %>

SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
				<td class="text-center">
					<%= link_to edit_producto_path(Producto.find(producto.id)), class:"btn btn-small btn-primary" do %>