app/controllers/marcas_controller.rb

  def index
  	@marcas = Marca.all
---
SELECT "marcas".* FROM "marcas"

  def show
  	@marca = Marca.find(params[:id])
---
SELECT  "marcas".* FROM "marcas" WHERE "marcas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
  	@marca = Marca.create(nombre: params[:marca][:nombre])
---
INSERT INTO "marcas" ("nombre", "created_at", "updated_at") VALUES (?, ?, ?)  [["nombre", "Sabritas"], ["created_at", "2017-10-15 23:23:57.430730"], ["updated_at", "2017-10-15 23:23:57.430730"]]

  def destroy
  	@marca = Marca.find(params[:id])
  	@marca.destroy
---
SELECT  "marcas".* FROM "marcas" WHERE "marcas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "marcas" WHERE "marcas"."id" = ?  [["id", 1]]

  def update
  	@marca = Marca.find(params[:id])

  	if @marca.update(nombre: params[:marca][:nombre])
---
SELECT  "marcas".* FROM "marcas" WHERE "marcas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "marcas" SET "nombre" = ?, "updated_at" = ? WHERE "marcas"."id" = ?  [["nombre", "afasdfsdafasdfdasfsdf"], ["updated_at", "2017-10-16 02:14:13.550017"], ["id", 7]]

  def edit
  	@marca = Marca.find(params[:id])
---
SELECT  "marcas".* FROM "marcas" WHERE "marcas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]