app/controllers/productos_controller.rb

SELECT "productos".* FROM "productos"
---
  def index
  	@productos = Producto.all

INSERT INTO "productos" ("nombre", "marca", "descripcion", "precio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
  	@producto = Producto.create(
      nombre: params[:producto][:nombre],
      marca: params[:producto][:marca],
      descripcion: params[:producto][:descripcion],
      precio: params[:producto][:precio])

SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "productos" WHERE "productos"."id" = ?  [["id", 1]]
---
  def destroy
  	@producto = Producto.find(params[:id])
  	@producto.destroy

SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "productos" SET "descripcion" = ?, "updated_at" = ? WHERE "productos"."id" = ?  [["descripcion", "Churrumais con limoncito. Frituras de harina de maíz con chile y sabor limón. Saben ricos con ketchup, recomendado !"], ["updated_at", "2017-10-19 02:26:57.065792"], ["id", 4]]
---
  def update
  	@producto = Producto.find(params[:id])

  	if @producto.update(
      nombre: params[:producto][:nombre],
      marca: params[:producto][:marca],
      descripcion: params[:producto][:descripcion],
      precio: params[:producto][:precio])

SELECT  "productos".* FROM "productos" WHERE "productos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
  	@producto = Producto.find(params[:id])